[
  {
    "title": "Stella Learning",
    "status": "In Progress",
    "description": "A (spaced repetition) learning app that integrates with note taking apps like Obsidian. Implementing a flat deck using a priority queue to learn items. You are able to create various kinds of learning items, from simple flash cards to cloze images and using files as learn items. Being able to create summaries for notes using AI and many many more feature all there to help me (and maybe you) to learn more in less time.",
    "technologies": [
      "C#",
      "Avalonia",
      "Multiplatform",
      "Avalonia Flecs",
      "Gemini"
    ],
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/Applications/StellaLearning"
      }
    ]
  },
  {
    "title": "Stella Fuzzy Pattern Matcher (SFPM)",
    "status": "Completed",
    "description": "The main problem I wanted to solve is reactivity with changing dynamic contexts. We could rephrase this as branching trees. Imagine a dialog tree that includes many different flags and acknowledges many different variables like how many birds you saw. Conceptually this is nothing more than various deeply nested if else conditions and statements. When those are simple they are simple, when they are complex we have a problem. To solved this I developed a fuzzy pattern matcher that works on a list of rules with various conditions. Both conditions and rules can be changed at runtime.",
    "technologies": [
      "C#",
      "JavaScript"
    ],
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/stella_fuzzy_pattern_matcher"
      },
      {
        "name": "NuGet",
        "url": "https://www.nuget.org/packages/StellaFuzzyPatternMatcher"
      },
      {
        "name": "npm",
        "url": "https://www.npmjs.com/package/sfpm-js"
      },
      {
        "name": "Blog Post",
        "url": "/posts/Writing-a-Fuzzy-Pattern-Matcher-In-CSharp"
      }
    ]
  },
  {
    "title": "Stella-ECS-JS",
    "status": "Completed",
    "description": "A high-performance, feature-rich Entity-Component-System (ECS) library for JavaScript and TypeScript. Designed with a modern, fluent API, it uses an archetype-based architecture for efficient iteration and includes a relationship graph to model complex connections between entities. It supports dynamic components and full world serialization.",
    "technologies": [
      "JavaScript",
      "ECS"
    ],
    "links": [
      {
        "name": "npm",
        "url": "https://www.npmjs.com/package/stella-ecs-js"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/stella-ecs-js"
      }
    ]
  },
  {
    "title": "Stella-HTN-JS",
    "status": "Completed",
    "description": "A flexible and powerful Hierarchical Task Network (HTN) planner for creating complex and emergent AI behaviors in JavaScript. It allows AI to adapt to a changing world through runtime planning, plan interruption, and replanning. It features a system for context-aware 'Smart Objects'.",
    "technologies": [
      "JavaScript",
      "HTN",
      "AI"
    ],
    "links": [
      {
        "name": "npm",
        "url": "https://www.npmjs.com/package/stella-htn-js"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/stella-htn-js"
      }
    ]
  },
  {
    "title": "Smart Trash Tray Icon",
    "status": "Completed",
    "description": "A lightweight, cross-platform tray utility for managing your system's trash bin. Built with .NET and Avalonia UI, it provides a simple way to monitor and manage your deleted files on Windows, macOS, and Linux, including real-time size display in the tooltip. All in less than 300 lines of code.",
    "technologies": [
      "C#",
      "Avalonia",
      "Multiplatform",
      "Avalonia Flecs"
    ],
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/Applications/SmartTrashTrayIcon"
      }
    ]
  },
  {
    "title": "Avalonia Flecs",
    "status": "In Progress",
    "description": "I really dont like xaml/xml. It always felt like fighting it. I was somewhat spoiled by flutter and modern JavaScript front-end frameworks. What I really wanted was a declarative way to declare a UI in code. So I combined the ECS framework Flecs.Net with Avalonia and wrote my own declarative UI-Builder that I can use like any other code. Its directly used in my Stella Learning app.",
    "technologies": [
      "Flecs.Net",
      "C#",
      "Avalonia"
    ],
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/Avalonia/Avalonia.Flecs"
      },
      {
        "name": "Example Usage",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/blob/main/Avalonia/Avalonia.Flecs/Avalonia.Flecs.ToDoApp/App.axaml.cs"
      }
    ]
  },
  {
    "title": "Email Status Service",
    "status": "Completed",
    "description": "A simple .NET utility class designed to send server status updates and deployment notifications via email. It's configured using environment variables and sends color-coded, formatted HTML emails to report successes, warnings, or errors from any C# application.",
    "technologies": [
      "C#",
      ".NET"
    ],
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/EmailStatusService"
      }
    ]
  },
  {
    "title": "Personal Website",
    "status": "In Progress",
    "description": "The very website you're on now! A personal space to blog, showcase projects, share my creative work, spit my feelings and opinions on. My site uses continuous integration and every time my personal pages changes it automatically redeploys using blue/green deployment.",
    "technologies": [
      "Astro",
      "Svelte",
      "JavaScript",
      "Cloudflare",
      "Hetzner",
      "Podman",
      "Docker"
    ],
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/AyanamiKaine/Ayanami-sTower/tree/main/PersonalWebsite"
      }
    ]
  },
  {
    "title": "Stella Invicta",
    "status": "On Hold",
    "description": "As a fan of all grand strategy. It's my personal dream to some day create my own grand strategy game.",
    "technologies": [],
    "links": []
  }
]